src/test/resources/biz/turnonline/ecosystem/billing/model/purchase-order.pubsub.json

{
    "beginOn": "2020-04-30T22:00:00.000Z",
    "createdDate": "2020-01-08T06:03:04.905Z",
    "creditor": {
        "account": "51385463860",
        "businessName": "My CtoolkiT business, Ltd ",
        "city": "Bratislava",
        "companyId": "35123123",
        "contact": {
            "email": "frederic.public@ctoolkit.org",
            "name": "Frederic Public",
            "phone": "+421 905 007 001",
            "website": "https://www.turnonline.biz"
        },
        "country": "SK",
        "latitude": 48.1574429,
        "legalForm": "ltd",
        "logoServingUrl": "https://lh3.googleusercontent.com/h_oO9DMTbQrj1AFeiiO9",
        "longitude": 17.1656705,
        "postcode": "821 04",
        "street": "Jašíkova 2",
        "taxId": "2022125123",
        "vatId": "SK2022123123",
        "vatPayer": true
    },
    "currency": "EUR",
    "customer": {
        "account": "565728947417",
        "email": "debtor.account@turnonline.biz",
        "contactEmail": "debtor.account@turnonline.biz",
        "ccEmail": "",
        "contactPhone": "",
        "locale": "sk",
        "logoServingUrl": "https://lh3.googleusercontent.com/7EQ-5lTt9r0cigewwy8fcknX",
        "firstName": "ADP Tikety",
        "street": "Trnavská cesta 74A",
        "city": "Bratislava",
        "country": "SK",
        "postcode": "821 02",
        "businessName": "Nice Academy, s.r.o.",
        "companyId": "35123129",
        "taxId": "2022123129",
        "vatId": "SK2022123129"
    },
    "id": "565941286574",
    "invoiceType": "TAX_DOCUMENT",
    "items": [
        {
            "id": "572584054122",
            "parentKey": "Order:565941286574",
            "itemName": "Bebe seminar",
            "inline": "Bebe seminar",
            "itemType": "OrderItem",
            "checkedIn": true,
            "priceExclVat": 29.0,
            "amount": 1.0,
            "unit": "ITEM",
            "vat": "STANDARD",
            "valueAddedTax": 20.0,
            "finalPrice": 34.8,
            "finalPriceExclVat": 29.0,
            "finalVatBase": 29.0,
            "finalValueAddedTax": 20.0,
            "finalVat": "STANDARD",
            "currency": "EUR",
            "discountApplied": false,
            "discountDefined": false,
            "discountCodeDefined": false
        }
    ],
    "lastBillingDate": "2020-01-10T15:33:34.425Z",
    "modificationDate": "2020-01-10T15:33:34.981Z",
    "nextBillingDate": "2020-07-10T15:33:34.425Z",
    "numberOfDays": 14,
    "periodicity": "SEMI_ANNUALLY",
    "status": "ACTIVE",
    "totalPrice": 34.8,
    "totalPriceExclVat": 29.0,
    "totalVatBase": 29.0
}